import Image from "next/image";
import styles from "./history.module.css";

export default function AboutHistoryPage() {
  return (
    <>
      <h2 className={`${styles.contentTitle} ThaiFont`}>
        ประวัติความเป็นมา
      </h2>

      <div className={`${styles.contentBody} ThaiFont`}>
        <p>
                   การประกอบวิชาชีพเภสัชกรรม ถือเป็นการประกอบโรคศิลปะ
          ซึ่งผู้ที่จะประกอบอาชีพทางด้านนี้ได้จำเป็นจะต้องมีความรู้ทางด้าน
          เภสัชศาสตร์ ในปี พ.ศ. 2456
          สมเด็จพระเจ้าบรมวงศ์เธอกรมพระยาชัยนาทนเรนทรจึงได้ทรงวางรากฐานและก่อตั้งโรงเรียนแพทย์ปรุงยาขึ้น
          ในโรงเรียนราช แพทยาลัย โรงพยาบาลศิริราช ซึ่งผู้ที่จบออกมาเรียกว่า
          “แพทย์ปรุงยา” และในปี พ.ศ. 2466 พระองค์ได้ทรงเล็งเห็นถึงความ
          สำคัญของวิชาชีพนี้ ต่อการประกอบโรคศิลปะ  จึงได้ทรงดำริถึง
          กฎหมายสำหรับคุ้มครองและควบคุมการประกอบวิชาชีพนี้ไว้ด้วย ในสมัยที่
          พระองค์ท่านดำรงตำแหน่งอธิบดีกรม สาธารณสุข
          จึงได้จัดให้มีพระราชบัญญัติการแพทย์  พ.ศ. 2466 ขึ้น และต่อมาในปี พ.ศ.
          2478 ก็ได้ประกาศใช้ พระราชบัญญัติควบคุม การประกอบโรคศิลปะ พ.ศ. 2479
          มีผลบังคับใช้ตั้งแต่วันที่  1  ตุลาคม พ.ศ. 2480  โดยให้เหตุผลว่า
          เป็นการสมควรที่จะบำรุงมาตรฐานการ ประกอบโรคศิลปะให้ดียิ่งขึ้น เพื่อ
          สวัสดิการของประชาชน  และให้ยกเลิกพระราชบัญญัติการแพทย์ 2466
          พระราชบัญญัติการแพทย์เพิ่มเติม พ.ศ. 2476 
          ตั้งแต่นั้นมาการประกอบวิชาชีพ เภสัชกรรมและวิชาชีพอื่น ๆ
          ที่เกี่ยวข้องเช่น เวชกรรม  ทันตกรรม  การพยาบาล จึงอยู่ภายใต้การควบคุม
          ดูแลของคณะกรรมการควบคุมการประกอบโรค ศิลปะ
          ซึ่งตั้งขึ้นโดยอาศัยความในมาตรา 6 ของพระราชบัญญัติฉบับนี้ 
          คณะกรรมการควบคุมการ ประกอบโรคศิลปะมีอำนาจหน้าที่สำคัญ เช่น 
          การรับขึ้นทะเบียน และออกใบอนุญาต
          แก่บุคคลซึ่งสมควรเป็นผู้ประกอบโรคศิลปะตามความใน
          พระราชบัญญัติสั่งพักหรือ เพิกถอนใบอนุญาตผู้ประกอบโรคศิลปะ 
          ดังนั้นผู้ประกอบ วิชาชีพเภสัชกรรมจึงต้องขอขึ้นทะเบียนและได้รับใบอนุญาต
          ก่อนจึงจะประกอบวิชาชีพได้  นอกจากนั้นยังมีกฎกระทรวงที่ออกตามความ
          ในพระราชบัญญัติฉบับนี้ให้ผู้ประกอบโรคศิลปะทุกสาขาต้องรักษา
          มรรยาทแห่งวิชาชีพ โดยไม่ประพฤติหรือกระทำการใด ๆ อันอาจเป็นเหตุ
          เสื่อมเสีย เกียรติศักดิ์แห่งวิชาชีพของตน  และต้องไม่ประพฤติหรือกระทำ
          การตามที่กำหนดไว้ในประกาศ 
        </p>

        <div className={styles.contentImageRow}>
          <Image
            src="/images/public/about/list/imgabout1.png"
            alt="ประวัติสภาเภสัชกรรม"
            width={600}
            height={400}
            className={styles.contentImage}
            style={{ height: "400px", objectFit: "cover" }}
          />
        </div>

        <p>
                ด้วยเหตุผลที่การประกอบโรคศิลปะแผนปัจจุบัน
          สาขาเภสัชกรรมอยู่ในความควบคุมตามกฎหมายว่าด้วยการควบคุมการประกอบโรคศิลปะ
          ซึ่งมีคณะ
          กรรมการควบคุมการประกอบโรคศิลปะทำหน้าที่ควบคุมการประกอบโรคศิลปะสาขาต่าง
          ๆ ทั้งแผนปัจจุบัน และแผนโบราณ ในปัจจุบัน วิชาการและ
          เทคโนโลยีทางด้านเภสัชศาสตร์ในประเทศไทยได้เจริญก้าวหน้าขึ้นเป็นอันมากประกอบกับจำนวนผู้ประกอบโรคศิลปะ
          สาขาเภสัชกรรมมีจำนวนมากขึ้น
          เภสัชกรรมสมาคมแห่งประเทศไทยในพระบรมราชูปถัมภ์ จึงได้เห็นสมควรว่า
          ควรจะแยกการควบคุมการ ประกอบวิชาชีพเภสัชกรรมออกจากอำนาจ
          หน้าที่ของคณะกรรมการควบคุมการประกอบโรคศิลปะ
          โดยให้มีการตั้งสภาเภสัชกรรมแทน คณะกรรมการควบคุมการประกอบโรคศิลปะ 
          จึงได้มีการจัด สัมมาขึ้น ณ สวางคนิวาส เมื่อวันที่ 27 กรกฎาคม พ.ศ.
          2522  เพื่อเปิดให้สมาชิก ได้แสดงความคิดเห็น
          เกี่ยวกับการที่จะให้มีสภาควบคุมกันเอง และเมื่อวันที่ 1 ตุลาคม พ.ศ.
          2526 สมาคมก็ได้จัดให้มีการประชุมใหญ่วิสามัญขึ้น ณ สโมสรกองทัพบก 
          และได้มีมติให้ร่าง พระราชบัญญัติวิชาชีพเภสัชกรรมขึ้นโดยมี
          ศ.ดร.ภก.บุญอรรถ  สายศร  เป็นประธานการจัดทำร่าง พระราชบัญญัติวิชาชีพ
          เภสัชกรรมได้ดำเนินการมาอย่างเป็นขั้นตอน  จนในที่สุดในการประชุม
          สภาผู้แทนราษฎร ชุดที่ 18  ปีที่ 1 ครั้งที่ 16 ลงมติรับหลักการ
          และท้ายสุด ในการประชุมวุฒิสภาเมื่อวันที่ 3 ธันวาคม พ.ศ. 2536
          ก็ได้พิจารณาผ่านร่าง  พระราชบัญญัติวิชาชีพเภสัชกรรม
          ร่างที่ผ่านมานี้ก็ได้ถูกดำเนินการ ต่อไปเพื่อประกาศเป็น พระราชบัญญัติ
          ซึ่งก็ได้ลงประกาศในราชกิจจานุเบกษา  เมื่อ วันที่ 30 มิถุนายน พ.ศ. 2537
          โดยมีผลบังคับใช้ตั้งแต่วันที่ 1 กรกฎาคม พ.ศ. 2537    
          ตั้งแต่นั้นมา การประกอบวิชาชีพเภสัชกรรม ก็อยู่ภายใต้การควบคุม
          ตามพระราช บัญญัติวิชาชีพเภสัชกรรม พ.ศ. 2537 
          เภสัชกรผู้ที่ประกอบวิชาชีพเภสัชกรรมก็จะต้องปฏิบัติตามจรรยาบรรณ
          และข้อบังคับสภาเภสัชกรรม ที่ว่าด้วยข้อจำกัด และเงื่อนไขในการประกอบ
          วิชาชีพที่สภากำหนดไว้ 
        </p>

        <p>
            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
          การประกอบวิชาชีพเภสัชกรรม ได้มีการพัฒนาและวิวัฒนาการขึ้นมาตามลำดับ
          ตามความเจริญของศาสตร์ทางด้านนี้ และมีผู้ที่จบ
          เภสัชศาสตร์ออกมาประกอบวิชาชีพในสาขาต่าง ๆ มากยิ่งขึ้น
          ได้มีการเลือกประกอบวิชาชีพตามสายงานต่าง ๆ แยกตามสาขาที่ตนสนใจและมี
          ความต้องการอย่างชัดเจน ซึ่งสายงานที่เภสัชกรส่วนใหญ่เลือกประกอบวิชาชีพ
          ได้แก่ เภสัชกรรมโรงพยาบาล เภสัชกรรมสมุนไพรการคุ้มครอง ผู้บริโภคด้านยา
          และสุขภาพ เภสัชกรรม อุตสาหการ การบริหารเภสัชกิจ และเภสัชกรรมชุมชน  
        </p>

        <h3>ประวัติสภาเภสัชกรรม</h3>

        <p>
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
          สภาเภสัชกรรม เป็นองค์กรวิชาชีพเภสัชกรรม มีสถานะเป็นนิติบุคคล
          ก่อตั้งขึ้นตาม พระราชบัญญัติวิชาชีพเภสัชกรรม พ.ศ. 2537 ให้ไว้ ณ วันที่
          26 มิถุนายน พ.ศ. 2537 ประกาศในราชกิจจานุเบกษา เล่มที่ 111 ตอนที่ 28 ก 
        </p>

        <p>
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
          เหตุผลในการประกาศใช้พระราชบัญญัติฉบับนี้
          คือ “ในปัจจุบันวิชาการและเทคโนโลยีทางด้านเภสัชศาสตร์ในประเทศไทยได้เจริญก้าวหน้า
          ขึ้นเป็นอันมาก ประกอบกับจำนวนผู้ประกอบโรคศิลปะสาขาเภสัชกรรมมีจำนวนมากขึ้น 
          สมควรแยกการควบคุมการประกอบวิชาชีพ เภสัชกรรม
          ออกจากอำนาจหน้าที่ของคณะกรรมการควบคุมการประกอบโรคศิลปะ 
          โดยจัดตั้งสภาเภสัชกรรมขึ้นให้ทำหน้าที่ส่งเสริมและ
          ควบคุมมาตรฐานการประกอบวิชาชีพเภสัชกรรมได้โดยอิสระ
          เหมาะสมและมีประสิทธิภาพยิ่งขึ้น จึงจำเป็นต้องตราพระราชบัญญัตินี้” 
        </p>
        <p>
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
          ตามพระราชบัญญัติวิชาชีพเภสัชกรรม (ฉบับที่ 2) พ.ศ. 2558
          กำหนดนิยามการประกอบวิชาชีพเภสัชกรรม  หมายความว่า “วิชาชีพที่เกี่ยว
          กับการกระทำในการเตรียมยา การผลิตยา การประดิษฐ์ยา การเลือกสรรยา
          การวิเคราะห์ยา การควบคุมและการประกัน คุณภาพยา  การปรุง
          และจ่ายยาตามใบสั่งยาของผู้ประกอบวิชาชีพเวชกรรม
          ผู้ประกอบวิชาชีพทันตกรรม ผู้ประกอบวิชาชีพการสัตวแพทย์ การปรุงยา
          การจ่ายยา การขาย ยา และการดำเนิน การตามกฎหมายว่าด้วยยาและกฎหมายอื่น ๆ
          ที่เกี่ยวเนื่องกับยา การให้คำแนะนำปรึกษาและการคุ้มครอง ผู้บริโภคด้านยา
          รวมทั้งการดำเนินการหารือ
          ร่วมกับผู้ประกอบวิชาชีพด้านการแพทย์และสาธารณสุขในการค้นหาป้องกันและแก้ไขปัญหา
          ที่เกี่ยวเนื่องกับการใช้ยา”
        </p>

        <p>
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
          ปัจจุบัน ปี พ.ศ. 2568 สภาเภสัชกรรม ก่อตั้งมาแล้ว 30 ปี และจะครบปีที่
          31 ในวันที่ 26 มิถุนายน พ.ศ. 2568 ดำเนินงานโดยคณะกรรมการ สภาเภสัชกรรม
          วาระที่ 11 (พ.ศ. 2568-2570) 
        </p>

       <div className={styles.infoCard}>
          <div className={styles.infoImageWrapper}>
            <img
              alt="วัตถุประสงค์การก่อตั้งสภาเภสัชกรรม"
              src="/images/public/about/list/imgabout2.png"
              className={styles.infoImage}
            />
          </div>

          <div className={styles.infoContent}>
            <h2 className={styles.infoTitle}>วัตถุประสงค์การก่อตั้งสภาเภสัชกรรม</h2>
            <p className={styles.infoSubtitle}>(มาตรา 8 แห่งพระราชบัญญัติวิชาชีพเภสัชกรรม พ.ศ. 2537)</p>
            <div className={styles.infoList}>
              <p className={styles.infoListItem}>(1) ส่งเสริมการศึกษาการวิจัยและการประกอบวิชาชีพเภสัชกรรม</p>
              <p className={styles.infoListItem}>(2) ส่งเสริมความสามัคคีและผดุงเกียรติของสมาชิก</p>
              <p className={styles.infoListItem}>(3) ผดุงไว้ซึ่งสิทธิ ความเป็นธรรมและส่งเสริมสวัสดิการให้แก่สมาชิก</p>
              <p className={styles.infoListItem}>(4) ควบคุมความประพฤติของผู้ประกอบวิชาชีพเภสัชกรรมให้ถูกต้องตามจรรยาบรรณ แห่งวิชาชีพเภสัชกรรม</p>
              <p className={styles.infoListItem}>(5) ช่วยเหลือ แนะนำ เผยแพร่และให้การศึกษาแก่ประชาชนและองค์กรอื่นในเรื่อง ที่เกี่ยวกับการเภสัชกรรม และการสาธารณสุข</p>
              <p className={styles.infoListItem}>(6) ให้คำปรึกษาหรือข้อเสนอแนะต่อรัฐบาลเกี่ยวกับการเภสัชกรรมและการสาธารณสุข</p>
              <p className={styles.infoListItem}>(7) เป็นตัวแทนของผู้ประกอบวิชาชีพเภสัชกรรมในประเทศไทย</p>
            </div>
          </div>
        </div>

        {/* การ์ดใบที่ 2: อำนาจหน้าที่ */}
        <div className={styles.infoCard}>
          <div className={styles.infoImageWrapper}>
            <img
              alt="อำนาจหน้าที่ของสภาเภสัชกรรม"
              src="/images/public/about/list/imgabout3.png"
              className={styles.infoImage}
            />
          </div>

          <div className={styles.infoContent}>
            <h2 className={styles.infoTitle}>อำนาจหน้าที่ของสภาเภสัชกรรม</h2>
            <p className={styles.infoSubtitle}>(มาตรา 9 แห่งพระราชบัญญัติวิชาชีพเภสัชกรรม พ.ศ. 2537)</p>
            <div className={styles.infoList}>
              <p className={styles.infoListItem}>(1) รับขึ้นทะเบียนและออกใบอนุญาตให้แก่ผู้ขอเป็นผู้ประกอบวิชาชีพเภสัชกรรม</p>
              <p className={styles.infoListItem}>(2) วินิจฉัยชี้ขาดตามมาตรา 42 วรรคสาม</p>
              <p className={styles.infoListItem}>(3) รับรองปริญญา ประกาศนียบัตรในวิชาเภสัชศาสตร์หรือวุฒิบัตรในวิชาชีพเภสัชกรรมของสถาบันต่าง ๆ เพื่อประโยชน์ในการสมัครเป็นสมาชิก</p>
              <p className={styles.infoListItem}>(4) รับรองหลักสูตรต่าง ๆ สำหรับการฝึกอบรมเป็นผู้ชำนาญการในสาขาต่าง ๆ ของ วิชาชีพเภสัชกรรมของสถาบันที่ทำการฝึกอบรมเป็นผู้ชำนาญการในสาขาต่าง ๆ ของ วิชาชีพเภสัชกรรม</p>
              <p className={styles.infoListItem}>(5) รับรองวิทยาฐานะของสถาบันที่ทำการฝึกอบรมใน (4)</p>
              <p className={styles.infoListItem}>(6) ออกหนังสืออนุมัติหรือวุฒิบัตรแสดงความรู้ความชำนาญในการประกอบวิชาชีพ เภสัชกรรมสาขาต่าง ๆ และออก หนังสือแสดงวุฒิอื่นในวิชาชีพเภสัชกรรม</p>
              <p className={styles.infoListItem}>(7) ดำเนินการให้เป็นไปตามวัตถุประสงค์ของสภาเภสัชกรรม</p>
            </div>
          </div>
        </div>

        <h3>คณะกรรมการสภาเภสัชกรรม</h3>

        <ol>
          <li>
            (มาตรา 15 แห่งพระราชบัญญัติวิชาชีพเภสัชกรรม พ.ศ.
            2537) มีวาระอยู่ในตำแหน่งคราวละสามปี ประกอบด้วย
          </li>
          <li>
            1) กรรมการโดยตำแหน่ง ได้แก่ ปลัดกระทรวงสาธารณสุข
            นายกเภสัชกรรมสมาคมแห่งประเทศไทยในพระบรมราชูปถัมภ์ คณบดีคณะ
            เภสัชศาสตร์ในสถาบันอุดมศึกษาที่ได้รับความเห็นชอบหรือได้รับอนุญาตจากกระทรวงการอุดมศึกษาฯ
            ให้จัดตั้งขึ้นตามที่กระทรวงการอุดมศึกษาฯ เสนอจำนวนห้าคน
          </li>
          <li>
            2) กรรมการซึ่งได้รับแต่งตั้ง โดยเป็นผู้แทนจากกระทรวงสาธารณสุข
            จำนวนสามคน จากกระทรวงกลาโหมจำนวนหนึ่งคน และจากกระทรวง
            มหาดไทยจำนวนหนึ่งคน
          </li>
          <li>
            3) กรรมการซึ่งได้รับเลือกตั้ง โดยสมาชิกมีจำนวนเท่ากับจำนวนกรรมการใน
            1) และ 2) รวมกัน
          </li>
        </ol>
      </div>
    </>
  );
}
